# Read the VHDL file(s)
read_vhdl your_design.vhdl

# Set the top module
# hierarchy -top your_top_module

# Run the ECP5 synthesis
synth_ecp5 -abc9

show -format dot -prefix topEntity

stat
